Revit 2024 API
FabricationAncillaryUsage Class
 Structure that holds information about the usage of a fabrication ancillary
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public class FabricationAncillaryUsage : IDisposable
Visual Basic
Public Class FabricationAncillaryUsage _
	Implements IDisposable
Visual C++
public ref class FabricationAncillaryUsage : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FabricationAncillaryUsage
See Also
FabricationAncillaryUsage Members
Autodesk.Revit.DB Namespace